app/views/notices/_form.html.erb

SELECT "users".* FROM "users"  ORDER BY "users"."username" ASC
---
        <%= f.label :user %><br>
        <%= f.collection_select :user_id, User.order(:username),:id,:username, include_blank: true %>