app/controllers/notices_controller.rb

    def index
        @notices = Notice.all
---
SELECT "notices".* FROM "notices"

    def show
        @notice = Notice.find(params[:id])
---
SELECT  "notices".* FROM "notices" WHERE "notices"."id" = $1 LIMIT 1  [["id", 1]]

    def edit
        @notice = Notice.find(params[:id])
---
SELECT  "notices".* FROM "notices" WHERE "notices"."id" = $1 LIMIT 1  [["id", 1]]

    def create
        @notice = Notice.new(notice_params)
        if @notice.save
---
INSERT INTO "notices" ("title", "message", "qcomments", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "VENDO PLATA"], ["message", "VENDO 20 MONEDAS DE $100 A $2000"], ["qcomments", 0], ["created_at", "2015-10-06 23:32:52.166104"], ["updated_at", "2015-10-06 23:32:52.166104"]]

    def update
        @notice = Notice.find(params[:id])
        if @notice.update(notice_params)
---
SELECT  "notices".* FROM "notices" WHERE "notices"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "notices" SET "user_id" = $1, "created_at" = $2, "updated_at" = $3 WHERE "notices"."id" = $4  [["user_id", 3], ["created_at", "2015-10-06 23:32:52.000000"], ["updated_at", "2015-10-06 23:36:18.696393"], ["id", 1]]

    def destroy
        @notice = Notice.find(params[:id])
        @notice.destroy
---
SELECT  "notices".* FROM "notices" WHERE "notices"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "notices" WHERE "notices"."id" = $1  [["id", 2]]