app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "age", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "Oscar"], ["last_name", "Estay"], ["age", 20], ["location", "Chile"], ["created_at", "2015-10-06 19:06:01.372135"], ["updated_at", "2015-10-06 19:06:01.372135"]]

    def update
        @user = User.find(params[:id])
        if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "gender" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["gender", "Hombre"], ["updated_at", "2015-10-06 20:13:30.932680"], ["id", 1]]